-- schedule_category 테이블에 더미 데이터 삽입
INSERT INTO schedule_category (schedule_category_id, user_id, title)
VALUES
(996, 999, '목욕'),
(997, 999, '산책'),
(998, 999, '사료 구입'),
(999, 999, '사냥 놀이');

-- schedule 테이블에 더미 데이터 삽입
INSERT INTO schedule (schedule_id, schedule_category_id, description, start_date, interval_type, interval_day, next_schedule_date, status)
VALUES
 (996, 996, '단지야 씻어야지?', '2024-09-15', '주', 2, '2024-10-13', '활성'),
 (997, 997, '단지랑 산책하기', '2024-10-01', '일', 1, '2024-10-08', '활성'),
 (998, 998, '내 새꾸들 사료 구입', '2024-09-01', '월', 1, '2024-11-01', '활성'),
 (999, 999, '홍시야 사냥놀이 하자', '2024-10-01', '일', 1, '2024-10-08', '활성');

-- ended_schedule 테이블에 더미 데이터 삽입
INSERT INTO ended_schedule (ended_schedule_id, user_id, schedule_category_title, schedule_description, created_at)
VALUES
(970, 999, '목욕', '단지도 목욕하니까 좋지?', '2024-09-15'),
(971, 999, '목욕', '단지도 목욕하니까 좋지?', '2024-09-29'),
(972, 999, '사료 구입', '이 사료를 더 좋아하는 거 같아', '2024-09-01'),
(973, 999, '사료 구입', '신상품도 좋아할까?', '2024-10-01'),
(974, 999, '산책', '단지랑 산책', '2024-10-01'),
(975, 999, '산책', '단지랑 산책', '2024-10-02'),
(976, 999, '산책', '단지랑 산책', '2024-10-03'),
(977, 999, '산책', '단지랑 산책', '2024-10-04'),
(978, 999, '산책', '단지랑 산책', '2024-10-05'),
(979, 999, '산책', '단지랑 산책', '2024-10-06'),
(980, 999, '산책', '단지랑 산책', '2024-10-07'),
(981, 999, '사냥 놀이', '홍시랑 사냥 놀이는 못 참지', '2024-10-01'),
(982, 999, '사냥 놀이', '홍시랑 사냥 놀이는 못 참지', '2024-10-02'),
(983, 999, '사냥 놀이', '홍시랑 사냥 놀이는 못 참지', '2024-10-03'),
(984, 999, '사냥 놀이', '홍시랑 사냥 놀이는 못 참지', '2024-10-04'),
(985, 999, '사냥 놀이', '홍시랑 사냥 놀이는 못 참지', '2024-10-05'),
(986, 999, '사냥 놀이', '홍시랑 사냥 놀이는 못 참지', '2024-10-06'),
(987, 999, '사냥 놀이', '홍시랑 사냥 놀이는 못 참지', '2024-10-07'),
-- pet_to_ended_schedule 테이블에 더미 데이터 삽입
INSERT INTO pet_to_ended_schedule (pet_id, ended_schedule_id)
VALUES
 (998, 970),
 (998, 971),
 (998, 972),
 (998, 973),
 (998, 974),
 (998, 975),
 (998, 976),
 (998, 977),
 (998, 978),
 (998, 979),
 (998, 980),
 (999, 972),
 (999, 973),
 (999, 981),
 (999, 982),
 (999, 983),
 (999, 984),
 (999, 985),
 (999, 986),
 (999, 987);

-- pet_to_schedule 테이블에 더미 데이터 삽입
INSERT INTO pet_to_schedule (pet_id, schedule_id)
VALUES
(998, 996),
(998, 997),
(998, 998),
(999, 998),
(999, 999);